#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
data.azurerm_linux_web_app.weu_session_manager: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backend_li: Still reading... [20s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_profile_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_servicebus_subscription.io_session_notifications_sub must be replaced
-/+ resource "azurerm_servicebus_subscription" "io_session_notifications_sub" {
      ~ auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ batched_operations_enabled                = false -> (known after apply)
      - dead_lettering_on_message_expiration      = false -> null
      ~ default_message_ttl                       = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ enable_batched_operations                 = false -> (known after apply)
      ~ id                                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub" -> (known after apply)
      ~ lock_duration                             = "PT1M" -> (known after apply)
        name                                      = "io-session-notifications-sub"
      ~ requires_session                          = false -> true # forces replacement
        # (7 unchanged attributes hidden)
    }

  # azurerm_servicebus_subscription_rule.session_events_filter must be replaced
-/+ resource "azurerm_servicebus_subscription_rule" "session_events_filter" {
      ~ id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub/rules/io-auth-session-events-filter" -> (known after apply)
        name                           = "io-auth-session-events-filter"
      ~ sql_filter_compatibility_level = 20 -> (known after apply)
      ~ subscription_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.function_lv_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-lv-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-lv-rg-01"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_lv_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lv-as-02" -> (known after apply)
      ~ location            = "italynorth" -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-lv-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lv-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.function_session_manager_internal.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_session_manager_internal_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-weu-auth-sm-int-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-main-rg-01"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_session_manager_internal_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-weu-auth-sm-int-as-01" -> (known after apply)
      ~ location            = "westeurope" -> (known after apply) # forces replacement
        name                = "io-p-weu-auth-sm-int-as-01"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-weu-auth-sm-int-asp-01" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "Default"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-weu-auth-sm-int-asp-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-weu-auth-sm-int-asp-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
